# CannotRemapTagReference Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TagFailures..::..CannotRemapTagReference Property
BuiltInFailures..::..TagFailures Class See Also
---
The tag reference was not remapped.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotRemapTagReference { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotRemapTagReference As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotRemapTagReference {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TagFailures Class
Autodesk.Revit.DB Namespace